In [1]:
import pandas as pd
import sqlite3 as sql
conn = sql.connect('database.sqlite')
conn

In [2]:
pd.read_sql_query('select * from salaries', conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,9999999.00,567595.43,2011,,San Francisco,
1,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
2,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
3,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
4,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082.74,,316285.74,316285.74,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148648,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148649,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148650,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [3]:
def sql_query(u):
    return pd.read_sql_query(u,conn)

#### **1. What is the average TotalPayBenefits for each JobTitle? exclude ('Not Provided', 'Not provided')**

In [4]:
u = '''select JobTitle, AVG(TotalPayBenefits) AS Avg_TotalPayBenefits
    From salaries where JobTitle not in ('Not Provided', 'Not provided')
    group by JobTitle order by Avg_TotalPayBenefits desc'''
sql_query(u)

                                            JobTitle  Avg_TotalPayBenefits
0                           Chief Investment Officer         436224.360000
1                                    Chief of Police         411732.266667
2                             Chief, Fire Department         408865.326667
3     GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY         399211.275000
4                         Gen Mgr, Public Trnsp Dept         380696.440000
...                                              ...                   ...
2153                           SPECIAL ASSISTANT XIV            673.800000
2154              BOARD/COMMISSION MEMBER, GROUP III            638.787879
2155                      BdComm Mbr, Grp2,M=$25/Mtg            475.047742
2156               BOARD/COMMISSION MEMBER, GROUP II            296.511628
2157         PUBLIC SAFETY COMMUNICATIONS TECHNICIAN            149.510000

[2158 rows x 2 columns]

#### **2. Show The JobTitle and Overtime Pay for All Employees With Overtime Pay greater than 50000**

In [5]:
u = '''select JobTitle, OvertimePay
    from Salaries where overtimepay > 50000'''


sql_query(u)

                                              JobTitle   OvertimePay
0                      CAPTAIN III (POLICE DEPARTMENT)     106088.18
1                 WIRE ROPE CABLE MAINTENANCE MECHANIC      56120.71
2                   BATTALION CHIEF, (FIRE DEPARTMENT)       89062.9
3                   BATTALION CHIEF, (FIRE DEPARTMENT)      86362.68
4     ASSISTANT CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)      71344.88
...                                                ...           ...
2163                           Parking Control Officer      54738.36
2164                                      Not provided  Not Provided
2165                                      Not provided  Not Provided
2166                                      Not provided  Not Provided
2167                                      Not provided  Not Provided

[2168 rows x 2 columns]

#### **3. What is the total number of unique employees? exclude ('Not Provided', 'Not provided')**

In [6]:
u = '''select distinct(employeename) from salaries 
    where employeename != 'Not provided' '''

sql_query(u)

              EmployeeName
0           NATHANIEL FORD
1           ALBERT PARDINI
2        CHRISTOPHER CHONG
3          PATRICK GARDNER
4           DAVID SULLIVAN
...                    ...
110804   Afakasi O Afakasi
110805      Kenneth Mackey
110806      Mark W Mcclure
110807  Charlene D Mccully
110808           Joe Lopez

[110809 rows x 1 columns]

#### **4.Show The Top 10 highest Paid Employees**

In [7]:
u= ''' select employeename , totalpay from salaries 
   order by totalpay desc limit 10'''
sql_query(u)

           EmployeeName    TotalPay
0        NATHANIEL FORD  9999999.00
1           David Shinn   471952.64
2            Amy P Hart   390111.98
3        Gary Altenberg   362844.66
4         John Goldberg   350403.41
5           Samson  Lai   347102.32
6       Ellen G Moffatt   344187.46
7  William J Coaker Jr.   339653.70
8        Gregory P Suhr   339282.07
9     Frederick Binkley   337204.86

#### **5.Show All Employees Ordered By Their TotalPay Benefits In Descending Order**

In [8]:
u= ''' select employeename , TotalPay Benefits from salaries 
   order by totalpay desc '''
sql_query(u)

          EmployeeName    Benefits
0       NATHANIEL FORD  9999999.00
1          David Shinn   471952.64
2           Amy P Hart   390111.98
3       Gary Altenberg   362844.66
4        John Goldberg   350403.41
...                ...         ...
148648   Roy I Tillery        0.00
148649    Not provided        0.00
148650    Not provided        0.00
148651    Not provided        0.00
148652       Joe Lopez     -618.13

[148653 rows x 2 columns]